In [1]:
# Importando Pandas
import pandas as pd

In [2]:
# Lista 2d com 3 linhas de dados
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
# Usando o list assim, ele separa cada caracter em um item de uma lista
list('321')

['3', '2', '1']

In [5]:
# Criando um DataFrame com o que vimos antes
df = pd.DataFrame(data, index = list('321'), columns = list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [6]:
# Modo simplificado de criar o mesmo DataFrame
df = pd.DataFrame(data, list('321'), list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [7]:
# Botando os itens em ordem alfabética, olhando pelo index
df.sort_index(inplace = True)

In [8]:
# Resultado
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [9]:
# Agora botando em ordem olhando pelo nome das colunas
df.sort_index(inplace = True, axis = 1)

In [10]:
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [11]:
# Agora botando em ordem pelos valores da coluna 'X'
df.sort_values(by = 'X', inplace = True)

In [12]:
# Resultado
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [13]:
# Botando em ordem pelos valores da linha '3', mas só de forma horizontal
df.sort_values(by = '3', axis = 1, inplace = True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [16]:
# Usando duas colunas para fazer a ordenação
df.sort_values(by = ['X', 'Y'], inplace = True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9